In [30]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("aircrahesFullDataUpdated_2024.csv")

In [3]:
df.head()

,Year,Quarter,Month,Day,Country/Region,Aircraft Manufacturer,Aircraft,Location,Operator,Ground,Fatalities (air),Aboard
0,1970,Qtr 2,April,28,NaN,de Havilland Canada,de Havilland Canada DHC 6 Twin Otter 100VH,Kainatu,Airlines Australia GuineaTrans New,0,8,11
1,1952,Qtr 2,April,30,NaN,Douglas,Douglas DC 3VT,Delhi,Airways IndiaDeccan,0,9,9
2,1973,Qtr 2,April,10,NaN,Vickers Vanguard,Vickers Vanguard 952G AXOP,Near Basel,(UK) Airlines International SwitzerlandInvicta,0,108,145
3,2000,Qtr 2,April,19,'-,Antonov,Antonov AN 8TL,Pepa -,Airlines Centrafricain,0,24,24
4,1946,Qtr 2,April,30,'-,Douglas,Douglas C 47A FZ559,Pindi-Khut -,Force Air Royal,0,12,12

In [4]:
#data cleaning
df.isnull().sum()

Year                       0
Quarter                    0
Month                      0
Day                        0
Country/Region           230
Aircraft Manufacturer      0
Aircraft                   0
Location                   0
Operator                 234
Ground                     0
Fatalities (air)           0
Aboard                     0
dtype: int64

In [5]:
df.shape

(5035, 12)

In [6]:
df = df.dropna()

In [7]:
df.isnull().sum()

Year                     0
Quarter                  0
Month                    0
Day                      0
Country/Region           0
Aircraft Manufacturer    0
Aircraft                 0
Location                 0
Operator                 0
Ground                   0
Fatalities (air)         0
Aboard                   0
dtype: int64

In [8]:
df.shape

(4758, 12)

In [9]:
df.head()

,Year,Quarter,Month,Day,Country/Region,Aircraft Manufacturer,Aircraft,Location,Operator,Ground,Fatalities (air),Aboard
3,2000,Qtr 2,April,19,'-,Antonov,Antonov AN 8TL,Pepa -,Airlines Centrafricain,0,24,24
4,1946,Qtr 2,April,30,'-,Douglas,Douglas C 47A FZ559,Pindi-Khut -,Force Air Royal,0,12,12
5,1960,Qtr 2,April,14,'-,Douglas,Douglas DC 4?,Taipei -,Force Air Thai Royal,0,18,18
6,2024,Qtr 2,April,23,Alaska,Douglas,Douglas C-54D Skymaster N3054V,Near Fairbanks,Alaska Air Fuel,0,2,2
7,1958,Qtr 2,April,21,10,Douglas,Douglas DC 7 / F,Near Sloan 10,Nevada Vegas Las of SW miles United Air L...,0,49,49

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4758 entries, 3 to 5034
Data columns (total 12 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Year                   4758 non-null   int64
 1   Quarter                4758 non-null   object
 2   Month                  4758 non-null   object
 3   Day                    4758 non-null   int64
 4   Country/Region         4758 non-null   object
 5   Aircraft Manufacturer  4758 non-null   object
 6   Aircraft               4758 non-null   object
 7   Location               4758 non-null   object
 8   Operator               4758 non-null   object
 9   Ground                 4758 non-null   int64
 10  Fatalities (air)       4758 non-null   int64
 11  Aboard                 4758 non-null   int64
dtypes: int64(5), object(7)
memory usage: 483.2+ KB

In [11]:
#to remove rows with "'-" and "10" as the Country/Region
df = df[~df.isin(["'-"]).any(axis=1)]
df = df[~df.isin(["10"]).any(axis=1)]
df.sample()

,Year,Quarter,Month,Day,Country/Region,Aircraft Manufacturer,Aircraft,Location,Operator,Ground,Fatalities (air),Aboard
3389,1952,Qtr 2,May,13,Brazil,Douglas,Douglas DC 3PP,Sao Paulo Brazil,VASP,0,5,22

In [12]:
df[df.duplicated()].sum()

Year                     0.0
Quarter                  0.0
Month                    0.0
Day                      0.0
Country/Region           0.0
Aircraft Manufacturer    0.0
Aircraft                 0.0
Location                 0.0
Operator                 0.0
Ground                   0.0
Fatalities (air)         0.0
Aboard                   0.0
dtype: float64

In [13]:

df["Country/Region"] = df["Country/Region"].str.split('\\').str[0]

In [14]:
df["Year"].max()

2024

In [15]:
bins = [1908,1919,1930,1941,1952,1963,1974,1985,1996,2007,2018,2024]
labels = ["1908-1919","1920-1930","1931-1941","1942-1952","1953-1963","1964-1974","1975-1985","1986-1996","1997-2007","2008-2018","2019-2024"]

In [16]:
df["Group_Year"] = pd.cut(df.Year,bins = bins,labels = labels)

In [17]:
df.head()

,Year,Quarter,Month,Day,Country/Region,Aircraft Manufacturer,Aircraft,Location,Operator,Ground,Fatalities (air),Aboard,Group_Year
6,2024,Qtr 2,April,23,Alaska,Douglas,Douglas C-54D Skymaster N3054V,Near Fairbanks,Alaska Air Fuel,0,2,2,2019-2024
8,1997,Qtr 2,April,23,Afghanistan,Antonov,Antonov AN 26?,Near Konduz Afghanistan,Force Air Republican Afghan - Military,0,36,36,1997-2007
9,1988,Qtr 2,April,10,Afghanistan,Antonov,Antonov AN 26?,Near Mazâr-e Charif Afghanistan,Force Air Republican Afghan - Military,0,29,29,1986-1996
10,1993,Qtr 2,April,27,Afghanistan,Antonov,Antonov AN 32?,Near Kholm Afghanistan,Force Air Republican Afghan - Military,0,76,76,1986-1996
11,2006,Qtr 2,April,24,Afghanistan,Antonov,Antonov AN 32BZS,Lashkar Gah Afghanistan,(leased) Government U.S.,3,2,16,1997-2007

In [18]:
df["Aircraft Manufacturer"].nunique()

593

In [19]:
d1 = df.groupby("Quarter")["Aboard"].sum().reset_index()

In [20]:
d2 = df.groupby("Quarter")["Fatalities (air)"].sum().reset_index()

In [21]:
data4 = pd.merge(d1,d2,on = "Quarter")
data4

  Quarter  Aboard  Fatalities (air)
0   Qtr 1   34466             25427
1   Qtr 2   31302             22122
2   Qtr 3   43143             30403
3   Qtr 4   39360             28132

In [22]:
data7 = df["Aircraft"].value_counts().nlargest(10)
data7 = data7.to_frame(name="Count")
data7

                        Count
Boeing B 737               73
Boeing B 727               55
Boeing B 707               50
McDonnell Douglas DC 9     39
Douglas C 47A              38
Britten  Norman BN         36
McDonnell Douglas DC 8     35
Boeing B 747               27
Douglas DC 3PP             23
Douglas DC 3 (C            23

In [23]:
fatalities_sum = df.groupby("Aircraft")["Fatalities (air)"].sum()
ground_sum = df.groupby("Aircraft")["Ground"].sum()
people_aboard = df.groupby("Aircraft")["Aboard"].sum()
data7["fatalities(air)"] = fatalities_sum
data7["Ground"] = ground_sum
data7["Aboard"] = people_aboard

In [24]:
data7

                        Count  fatalities(air)  Ground  Aboard
Boeing B 737               73             3994      17    6550
Boeing B 727               55             4216      34    5523
Boeing B 707               50             2756     187    4348
McDonnell Douglas DC 9     39             1756     120    2569
Douglas C 47A              38              600       1     697
Britten  Norman BN         36              200       0     276
McDonnell Douglas DC 8     35             1354      48    2592
Boeing B 747               27             3764      54    5601
Douglas DC 3PP             23              289       7     464
Douglas DC 3 (C            23              334       2     569

In [28]:
df.Season = []
if df.Month == ['March', 'April', 'May']:
    df.Season = 'Spring'
elif df.Month == ['June', 'July', 'August']:
    df.Season = 'Summer'
elif df.Month == ['September', 'October', 'November']:
    df.Season = 'Autumn'
else :
    df.Season = 'Winter'

ValueError: ('Lengths must match to compare', (4752,), (3,))

In [31]:
conditions = [
    df['Month'].isin(['March', 'April', 'May']),
    df['Month'].isin(['June', 'July', 'August']),
    df['Month'].isin(['September', 'October', 'November'])
]

# Define corresponding choices
choices = ['Spring', 'Summer', 'Autumn']

# Apply logic
df['Season'] = np.select(conditions, choices, default='Winter')

In [38]:
data8

    index  Season
0  Winter    1248
1  Autumn    1246
2  Summer    1177
3  Spring    1081

In [42]:
data8 = df["Season"].value_counts().reset_index()
data8 = data8.rename(columns={"index": "Season", "Season": "Counts"})

In [43]:
data8

   Season  Counts
0  Winter    1248
1  Autumn    1246
2  Summer    1177
3  Spring    1081